{
  "backend/main.mo": "Main ICP actor implementing the backend for a Binance gift card store, including order management, user profiles, contact messages, site ownership, and admin access control.",
  "backend/migration.mo": "Data migration module that upgrades existing orders by adding denomination/usdtAmount fields and contact messages by adding an isRead field, with default values.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (admin dashboard, analytics, order filtering, bulk updates, etc.) to their source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of each frontend source file, describing the purpose and key changes of every component, page, hook, and utility in the project.",
  "frontend/index.css": "Global CSS entry point defining OKLCH-based design token variables for light and dark themes using Tailwind's base layer, including sidebar, chart, and destructive color tokens.",
  "frontend/index.html": "HTML shell for the React SPA with a root div mount point and a module script tag loading main.tsx; title reflects the Binance gift card store concept.",
  "frontend/src/App.tsx": "Defines the TanStack Router route tree for all public and admin-protected routes, wrapping admin routes in AdminRouteGuard and the entire app in SiteLayout and GlobalErrorBoundary.",
  "frontend/src/components/admin/AdminLayout.tsx": "Layout wrapper for admin pages that renders the AdminSidebar alongside a main content area in a flex container.",
  "frontend/src/components/admin/AdminSidebar.tsx": "Renders the admin panel sidebar with navigation links to Dashboard, Orders, and Messages, showing badge counts for pending orders and unread messages fetched via query hooks.",
  "frontend/src/components/admin/DenominationBreakdownChart.tsx": "Displays a donut pie chart breaking down order counts by USDT denomination using Recharts, accepting an array of [denomination, count] bigint tuples as props.",
  "frontend/src/components/admin/RecentActivityFeed.tsx": "Shows a combined feed of the most recent orders and contact messages, merging and sorting them by approximate recency with clickable order rows that navigate to order detail pages.",
  "frontend/src/components/admin/RevenueChart.tsx": "Renders a dual-axis bar chart of orders and USDT revenue distributed across the last 7 days using Recharts, approximating daily buckets since orders lack timestamps.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Guards admin routes by checking Internet Identity authentication and site owner status, showing login prompts, a claim-ownership flow, or rendering children if the user is the verified owner.",
  "frontend/src/components/checkout/BitcoinPaymentInstructions.tsx": "Displays Bitcoin payment details (order ID, BTC address, and amount) with copy-to-clipboard buttons and an alert reminding users to include their order ID in the transaction memo.",
  "frontend/src/components/error/GlobalErrorBoundary.tsx": "A React class-based error boundary that catches any thrown value (not just Error instances), logs details safely, and renders a user-provided fallback UI with a reset callback.",
  "frontend/src/components/error/SafeSection.tsx": "A wrapper component that uses GlobalErrorBoundary to isolate non-critical UI sections, silently hiding them (or showing an optional fallback) if they throw an error.",
  "frontend/src/components/layout/PromoTicker.tsx": "A scrolling ticker bar that displays a promotional flash-sale message alongside a live BTC/USDT price fetched via useBtcUsdtRate, with status indicators for live vs. cached rates.",
  "frontend/src/components/layout/SiteLayout.tsx": "The main site shell providing a sticky header with navigation links (including a conditional admin link), a PromoTicker, a RecentOrdersMenu, page content slot, and a footer.",
  "frontend/src/components/orders/RecentOrdersMenu.tsx": "A dropdown menu button that shows the user's five most recent orders with their statuses and badges, linking each to its order detail page, with loading and empty states.",
  "frontend/src/components/storefront/DenominationCardGrid.tsx": "A grid of selectable denomination cards displaying USDT face values, discounted prices, and BTC equivalents calculated from the live rate, with a rate status indicator bar above.",
  "frontend/src/components/storefront/DenominationRangeCallout.tsx": "A callout card that displays the minimum and maximum supported USDT denominations as badges to inform users of the available purchase range.",
  "frontend/src/components/storefront/DenominationSelector.tsx": "A labeled dropdown (Select) component for choosing a USDT denomination from the supported list, with a helper text showing the available range.",
  "frontend/src/components/storefront/QuantitySelector.tsx": "A numeric input with increment/decrement buttons for selecting a purchase quantity, clamped between configurable min and max values.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useBtcUsdtRate.ts": "React hook that fetches the BTC/USDT exchange rate with a fallback chain (CoinGecko → Binance → localStorage cache → hardcoded fallback), refreshing every 60 seconds via React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, and persisting identity across page reloads.",
  "frontend/src/hooks/useOrderHistory.ts": "React hook that loads persisted order history from local storage, keeps state in sync across tabs via storage events, and returns safe defaults on errors.",
  "frontend/src/hooks/useOrderHistoryDetails.ts": "React hook that fetches full order details for a list of order IDs from the backend actor in parallel using React Query's useQueries.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend interactions including fetching, creating, and updating orders, contact messages, and admin stats, with error formatting and cache invalidation.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives, defines light/dark CSS custom properties for the design system (including Binance-themed colors), and adds ticker animation styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Static informational page describing the marketplace, its features (denominations, Bitcoin payments, fast delivery, secure transactions), and how the ordering process works.",
  "frontend/src/pages/admin/AdminContactMessagesPage.tsx": "Admin page that lists all contact form submissions in a table with unread highlighting, expandable rows to view full messages, and a mark-as-read action.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard page displaying key store metrics (orders, revenue, messages) via stat cards, charts, and a recent activity feed, with live BTC/USDT rate integration.",
  "frontend/src/pages/admin/AdminOrderDetailPage.tsx": "Admin page for viewing and updating the status of a single order, identified by route param, with error and loading states.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin orders list page with filtering by status, sort order, bulk status updates, and per-row navigation to order detail.",
  "frontend/src/pages/CatalogPage.tsx": "Product catalog page where users select a Binance Gift Card denomination and quantity, then proceed to checkout by saving the cart session and navigating to the checkout route.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that collects buyer contact info, calculates a 50% discounted BTC payment amount using the live rate, submits the order to the backend canister, and displays Bitcoin payment instructions upon success.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page that collects a user's name, contact detail, and message, then submits it via the useCreateContactMessage mutation with success and error feedback.",
  "frontend/src/pages/FaqPage.tsx": "Static FAQ page using an accordion component to answer common questions about Binance Gift Cards, payment, delivery, discounts, and order tracking.",
  "frontend/src/pages/GlobalErrorFallbackPage.tsx": "A full-page error fallback component that displays error details (message and stack trace in dev mode) with options to reload the page or navigate home.",
  "frontend/src/pages/HomePage.tsx": "The marketing landing page featuring a hero section, denomination range callout, and a features grid highlighting Bitcoin payments, security, speed, and global access.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Displays a list of the user's past orders fetched from local history, enriched with live order details and status badges, with a link to each order's status page.",
  "frontend/src/pages/OrderStatusPage.tsx": "Shows detailed status and Bitcoin payment instructions for a single order identified by URL param, including live BTC/USDT rate conversion and status icons.",
  "frontend/src/pages/TrackOrderPage.tsx": "A simple form page where users enter an order ID to be navigated to the corresponding OrderStatusPage for tracking payment and delivery status.",
  "frontend/src/state/cartSession.ts": "Provides save, load, and clear helpers for persisting cart data (denomination, quantity, total) in sessionStorage.",
  "frontend/src/state/orderHistory.ts": "localStorage-backed order history store with in-memory fallback, supporting add, update, remove, and load operations with a 50-order cap.",
  "frontend/src/utils/btcRate.ts": "Utility functions for formatting BTC rate values and deriving display labels and warning flags based on the rate source.",
  "frontend/src/utils/denominations.ts": "Exports a single constant array of supported Binance gift card denominations.",
  "frontend/src/utils/errors.ts": "Utility functions for safely converting unknown errors to user-friendly messages and classifying errors by type (auth, connectivity, ownership, etc.).",
  "frontend/src/utils/orderStatus.ts": "Provides helper functions to convert backend OrderStatus enum values into simplified buyer-facing labels and badge variants for UI display.",
  "frontend/src/utils/pricing.ts": "Centralizes pricing logic including a fixed 50% discount rate and utility functions for USDT/BTC conversion, discount calculation, and amount formatting.",
  "frontend/src/utils/timeElapsed.ts": "Exports a single function that converts a Date, millisecond timestamp, or ICP nanosecond bigint into a human-readable relative time string (e.g., '5 minutes ago').",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters from both query strings and hash-based routing, with sessionStorage persistence helpers and a function to remove sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom color tokens (using oklch variables), typography, container queries, animation plugins, and custom font families including a Binance-themed color palette.",
  "project_state.json": "Tracks the overall project state for a Binance Gift Cards ICP app, listing implemented features, architectural notes, known issues, and versioning metadata for build planning."
}