{
  "backend/main.mo": "Motoko canister implementing site ownership, authorization, user profiles, order creation and management, and contact message storage with admin/owner access checks.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend files across pages, components, hooks, and styles.",
  "frontend/index.css": "Global Tailwind-based style definitions including OKLCH variables for light/dark themes and base element styling.",
  "frontend/index.html": "Base HTML template mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Main React router setup defining all public and admin routes wrapped in global layout and error boundaries.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard that enforces authentication and site ownership, handles login flow, and conditionally renders admin content or guidance.",
  "frontend/src/components/checkout/BitcoinPaymentInstructions.tsx": "Displays Bitcoin payment instructions with copy-to-clipboard buttons for order ID, BTC address, and amount. Provides alerts and styled sections to assist users in completing crypto payments.",
  "frontend/src/components/error/GlobalErrorBoundary.tsx": "A React error boundary that captures and logs errors safely and renders a fallback UI. Supports resetting and handles unknown error types gracefully.",
  "frontend/src/components/error/SafeSection.tsx": "Wraps UI sections in a lightweight error boundary to prevent isolated failures from breaking the app. Uses a simple fallback that hides failed sections.",
  "frontend/src/components/layout/PromoTicker.tsx": "Displays a horizontally scrolling promotional banner with repeated flash‑sale messages and icons. Enhances visibility of ongoing offers.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main site layout with header, navigation, promo ticker, recent orders menu, and footer. Handles admin link visibility based on user identity and actor readiness.",
  "frontend/src/components/orders/RecentOrdersMenu.tsx": "Shows a dropdown menu listing up to five recent orders with status badges and links. Fetches order history and details, handling loading and disabled states.",
  "frontend/src/components/storefront/DenominationCardGrid.tsx": "Renders a grid of denomination cards showing USDT values, discounts, and BTC equivalents, allowing selection of a denomination. Uses live or cached BTC rates to compute amounts.",
  "frontend/src/components/storefront/DenominationRangeCallout.tsx": "Displays a callout card highlighting the minimum and maximum supported USDT denominations. Provides a visual summary of available card values.",
  "frontend/src/components/storefront/DenominationSelector.tsx": "A dropdown selector for choosing a USDT denomination from supported values. Shows the available range and triggers value changes.",
  "frontend/src/components/storefront/QuantitySelector.tsx": "A numeric quantity selector with increment/decrement buttons and validation between min and max values.",
  "frontend/src/hooks/useActor.ts": "Creates and refreshes a backend actor based on Internet Identity state and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useBtcUsdtRate.ts": "Fetches BTC/USDT price with caching, fallback logic, and periodic refetching using React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity authentication and exposing identity state.",
  "frontend/src/hooks/useOrderHistory.ts": "Loads and syncs persisted order history with error handling and storage event listening.",
  "frontend/src/hooks/useOrderHistoryDetails.ts": "Fetches detailed order data for multiple order IDs using parallel React Query requests.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for orders and contact messages, handling CRUD operations via the backend actor.",
  "frontend/src/index.css": "Tailwind setup with custom CSS variables, theming, and ticker animation styles.",
  "frontend/src/main.tsx": "App entry point configuring React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AboutPage.tsx": "Displays company overview with sections on identity, offerings, and process using styled cards.",
  "frontend/src/pages/admin/AdminContactMessagesPage.tsx": "Admin page listing customer contact messages with loading and error handling.",
  "frontend/src/pages/admin/AdminOrderDetailPage.tsx": "Admin page that displays detailed info for a single order and allows updating its status with loading and error handling.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin table view listing all orders with status badges, navigation actions, and error/loading states.",
  "frontend/src/pages/CatalogPage.tsx": "Handles denomination and quantity selection, calculates totals, and saves cart data before navigating to checkout.",
  "frontend/src/pages/CheckoutPage.tsx": "Collects buyer details, validates cart session, creates discounted BTC orders, and shows payment instructions.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form that submits messages through a backend mutation with success and error handling.",
  "frontend/src/pages/FaqPage.tsx": "Shows an FAQ accordion covering gift card basics, payment, delivery, discounts, and order tracking.",
  "frontend/src/pages/GlobalErrorFallbackPage.tsx": "Displays a global error screen with options to reload or return home and shows detailed error info in development mode.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, product highlights, and navigation to the catalog.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Shows the user's past orders with status badges and handles loading and empty states.",
  "frontend/src/pages/OrderStatusPage.tsx": "Displays detailed status and payment information for a specific order, with live BTC‑USDT conversion.",
  "frontend/src/pages/TrackOrderPage.tsx": "Provides a form for users to enter an order ID and navigate to its status page.",
  "frontend/src/state/cartSession.ts": "SessionStorage-backed utility for saving, loading, and clearing the shopping cart state.",
  "frontend/src/state/orderHistory.ts": "LocalStorage-backed order history manager with in-memory fallback, supporting adding, updating, listing, and removing history entries.",
  "frontend/src/utils/denominations.ts": "Exports the supported fixed gift-card denomination values.",
  "frontend/src/utils/errors.ts": "Helpers for normalizing, formatting, and categorizing errors into user‑friendly messages.",
  "frontend/src/utils/orderStatus.ts": "Maps backend order statuses to simplified labels and badge variants used in the UI.",
  "frontend/src/utils/pricing.ts": "Utility functions for discount calculation, BTC/USDT conversion, and formatting currency values.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear or retrieve them with precedence rules.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom fonts, colors, container settings, and plugin integrations for typography, animations, and container queries.",
  "project_state.json": "Stores project metadata, existing features, pending requests, and overall state for a Binance-themed gift-card app."
}