{
  "backend/main.mo": "Motoko backend managing site ownership, access control, user profiles, orders, and contact messages with authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of various frontend components, pages, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind-based style definitions with OKLCH variables and dark mode overrides.",
  "frontend/index.html": "Base HTML page mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "React router setup defining public and admin routes wrapped in global error boundaries.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard managing Internet Identity login, ownership checks, and controlled access to admin pages.",
  "frontend/src/components/checkout/BitcoinPaymentInstructions.tsx": "Displays BTC payment details for an order with copy‑to‑clipboard actions for order ID, address, and amount.",
  "frontend/src/components/error/GlobalErrorBoundary.tsx": "Implements a React error boundary that logs detailed error info and renders a custom fallback on failure.",
  "frontend/src/components/error/SafeSection.tsx": "Wraps UI sections in an error boundary to prevent localized failures from crashing the app.",
  "frontend/src/components/layout/PromoTicker.tsx": "Renders a scrolling promo banner combined with live BTC rate information.",
  "frontend/src/components/layout/SiteLayout.tsx": "Main site layout with header, navigation, promo ticker, recent orders, and footer rendering.",
  "frontend/src/components/orders/RecentOrdersMenu.tsx": "Shows a dropdown of recent user orders with status badges and quick navigation links.",
  "frontend/src/components/storefront/DenominationCardGrid.tsx": "Displays purchasable USDT denominations with live BTC pricing, discounts, and selection highlighting.",
  "frontend/src/components/storefront/DenominationRangeCallout.tsx": "Shows a callout card highlighting the minimum and maximum available USDT denominations.",
  "frontend/src/components/storefront/DenominationSelector.tsx": "Dropdown selector for choosing a USDT denomination with range display.",
  "frontend/src/components/storefront/QuantitySelector.tsx": "Quantity input with increment/decrement buttons enforcing min/max bounds.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useBtcUsdtRate.ts": "Fetches and caches BTC/USDT rates with fallbacks and periodic refresh.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login handling, and stored identity restoration.",
  "frontend/src/hooks/useOrderHistory.ts": "Loads and tracks persisted order history with storage event syncing and error safety.",
  "frontend/src/hooks/useOrderHistoryDetails.ts": "Fetches details for multiple orders using parallel queries tied to the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for interacting with backend orders and contact messages.",
  "frontend/src/index.css": "Tailwind base styles and custom theme variables including Binance-inspired colors and ticker animation.",
  "frontend/src/main.tsx": "Initializes React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Displays information about the service, its offerings, and how the Binance gift card marketplace works.",
  "frontend/src/pages/admin/AdminContactMessagesPage.tsx": "Admin page listing all customer contact messages with table view, loading states, and navigation controls.",
  "frontend/src/pages/admin/AdminOrderDetailPage.tsx": "Admin page that loads a single order, shows detailed info, and lets admins update its status.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin listing page that fetches and displays all orders with status badges and navigation to order details.",
  "frontend/src/pages/CatalogPage.tsx": "Provides denomination selection, quantity choice, product details, and navigates users to checkout with saved cart data.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles order form submission, applies discounts, creates backend orders, and shows Bitcoin payment details.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form that sends messages through a backend mutation and shows success or error states.",
  "frontend/src/pages/FaqPage.tsx": "Shows frequently asked questions about Binance gift cards using an accordion layout.",
  "frontend/src/pages/GlobalErrorFallbackPage.tsx": "Displays a fallback UI for unexpected errors with options to reload or return home and shows detailed error info in development mode.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, feature highlights, and navigation to the product catalog.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Shows a user's past orders with status badges, loading states, and links to detailed order views.",
  "frontend/src/pages/OrderStatusPage.tsx": "Displays detailed status and payment information for a specific order, including BTC/USDT rate info and error handling.",
  "frontend/src/pages/TrackOrderPage.tsx": "Provides a form for users to enter an order ID and navigate to its status page, with basic validation and guidance.",
  "frontend/src/state/cartSession.ts": "SessionStorage-backed helpers for saving, loading, and clearing the cart state.",
  "frontend/src/state/orderHistory.ts": "LocalStorage-backed order history with in-memory fallback, providing load, add, update, and remove operations.",
  "frontend/src/utils/btcRate.ts": "Utility functions for formatting BTC rates and generating status labels and warnings based on data source.",
  "frontend/src/utils/denominations.ts": "Exports a fixed list of supported gift card denominations.",
  "frontend/src/utils/errors.ts": "Helpers for normalizing, formatting, and categorizing errors, including backend and network-specific cases.",
  "frontend/src/utils/orderStatus.ts": "Maps backend order statuses to simplified labels and badge variants for UI display.",
  "frontend/src/utils/pricing.ts": "Provides pricing utilities including discount application, BTC/USDT conversions, and amount formatting.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL params, storing them in sessionStorage, retrieving persisted values, and cleaning parameters from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending fonts, colors, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Metadata describing project state, issues, features, and pending requests related to integrating a live BTC price feed."
}