{
  "backend/main.mo": "Motoko canister managing site ownership, user profiles, orders, and admin‑restricted actions with authorization checks.",
  "feature_evidence.json": "Feature report indicating a checkout update to use a new Bitcoin address and listing related frontend files and metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of multiple frontend source files for reference.",
  "frontend/index.css": "Global Tailwind CSS variables and theme definitions for light and dark modes using OKLCH color tokens.",
  "frontend/index.html": "HTML entry point mounting the React app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for public pages and admin‑protected sections using the layout and guard components.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard enforcing authentication and site‑owner checks with login prompts, claim flow, and protected rendering.",
  "frontend/src/components/checkout/BitcoinPaymentInstructions.tsx": "UI component displaying order‑specific Bitcoin payment details with copy‑to‑clipboard helpers and warnings.",
  "frontend/src/components/layout/SiteLayout.tsx": "Top-level layout with header, navigation, admin link handling, recent orders menu, and footer wrapper.",
  "frontend/src/components/orders/RecentOrdersMenu.tsx": "Dropdown listing up to five recent orders with live status lookup and navigation links.",
  "frontend/src/components/storefront/DenominationCardGrid.tsx": "Grid of denomination cards showing discounted USDT and BTC amounts using the current BTC/USDT rate.",
  "frontend/src/components/storefront/DenominationRangeCallout.tsx": "Callout card displaying the minimum and maximum supported USDT denominations.",
  "frontend/src/components/storefront/DenominationSelector.tsx": "Select input for choosing a denomination from predefined USDT values with range info.",
  "frontend/src/components/storefront/QuantitySelector.tsx": "Quantity input with increment/decrement controls enforcing min/max bounds.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useBtcUsdtRate.ts": "Fetches BTC/USDT rate with caching, fallback logic, and periodic refresh via React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks to manage Internet Identity authentication with AuthClient, including login state and identity persistence.",
  "frontend/src/hooks/useOrderHistory.ts": "Loads and syncs persisted order history from storage and exposes loading state and order list.",
  "frontend/src/hooks/useOrderHistoryDetails.ts": "Fetches detailed order data for multiple order IDs using react-query and the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for fetching, creating, and updating orders and contact messages via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables, including custom Binance color tokens.",
  "frontend/src/main.tsx": "App entry point initializing React, react-query, and the InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Static About page describing the service, features, and platform benefits using styled UI components.",
  "frontend/src/pages/admin/AdminContactMessagesPage.tsx": "Shows a table of customer contact messages with loading/error states for admin review.",
  "frontend/src/pages/admin/AdminOrderDetailPage.tsx": "Displays detailed order info for admins and allows updating the order status.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Lists all orders for admin management with status badges and navigation to details or messages.",
  "frontend/src/pages/CatalogPage.tsx": "Gift card catalog page allowing denomination and quantity selection, saving cart data, and navigating to checkout.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow including buyer info, order creation, BTC amount calculation, and cart clearing, storing an order snapshot after successful submission. Shows validation, error handling, and payment instructions.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form that submits user messages via a mutation and displays success or error alerts. Manages simple form validation and resets fields upon success.",
  "frontend/src/pages/FaqPage.tsx": "Renders a FAQ page with accordion-based questions covering gift cards, payment, delivery, discounts, and order tracking. Contains static informational content only.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with a hero section, product intro, navigation buttons, denomination callout, and feature highlights. Focuses on marketing content and links to the catalog.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Fetches and displays a user’s stored order history with live status lookups and badge indicators. Handles loading, empty state, error display, and links to catalog if no orders exist.",
  "frontend/src/pages/OrderStatusPage.tsx": "Displays detailed order status, payment info, and BTC-to-USDT estimates with loading and error handling.",
  "frontend/src/pages/TrackOrderPage.tsx": "Provides a form to enter an order ID and navigate to the order status page with basic validation.",
  "frontend/src/state/cartSession.ts": "Manages saving, loading, and clearing cart data in sessionStorage.",
  "frontend/src/state/orderHistory.ts": "Maintains a localStorage-backed history of recent orders with add, update, remove, and clear operations.",
  "frontend/src/utils/denominations.ts": "Exports the list of supported gift card denominations.",
  "frontend/src/utils/errors.ts": "Provides utilities to normalize unknown errors and map backend error messages to friendly user-facing text.",
  "frontend/src/utils/orderStatus.ts": "Converts backend order statuses into simplified labels and badge variants for UI display.",
  "frontend/src/utils/pricing.ts": "Implements pricing logic including discount calculation, USDT/BTC conversions, and formatting helpers.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom themes, fonts, colors, container settings, and plugin integrations.",
  "project_state.json": "Stores project metadata, known issues, and feature requests related to updating the displayed BTC payment address."
}