{
  "backend/main.mo": "Motoko backend handling orders with create, get, list, and admin‑protected status updates using AccessControl.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file.",
  "frontend/index.css": "Global Tailwind‑based styling defining color tokens and theme variables for light and dark modes.",
  "frontend/index.html": "Root HTML page mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps admin pages with AdminRouteGuard for access control.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Gatekeeper component requiring Internet Identity login and admin status before rendering admin pages.",
  "frontend/src/components/checkout/BitcoinPaymentInstructions.tsx": "UI component showing BTC payment details, copy‑to‑clipboard actions, and order metadata.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main site layout with header, navigation, admin link logic, and footer structure.",
  "frontend/src/components/storefront/DenominationRangeCallout.tsx": "Displays a callout card showing the available USDT denomination range.",
  "frontend/src/components/storefront/DenominationSelector.tsx": "Provides a dropdown selector for choosing predefined USDT card denominations.",
  "frontend/src/components/storefront/QuantitySelector.tsx": "Renders a quantity input with increment/decrement controls and validation.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor tied to Internet Identity, invalidating queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context providing login, logout, and identity state management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating orders and checking admin status through the actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, React Query, and Internet Identity provider setup.",
  "frontend/src/pages/admin/AdminOrderDetailPage.tsx": "Admin view for inspecting a single order and updating its status.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin list of all orders with status badges and navigation to order detail pages.",
  "frontend/src/pages/CatalogPage.tsx": "Renders the gift card catalog page with denomination/quantity selection and checkout navigation.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout form, creates discounted BTC-based orders, shows errors, and displays success with payment instructions.",
  "frontend/src/pages/HomePage.tsx": "Renders marketing homepage with hero section, features, and navigation to the catalog.",
  "frontend/src/pages/OrderStatusPage.tsx": "Fetches and displays order status, payment details, and error states based on an order ID.",
  "frontend/src/state/cartSession.ts": "Manages saving, loading, and clearing cart data from sessionStorage.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and clear them from the hash.",
  "frontend/tailwind.config.js": "Defines Tailwind CSS configuration with custom theme colors, fonts, container settings, and plugins.",
  "project_state.json": "Describes the project state, features, known issues, and architectural notes for the gift card storefront."
}