{
  "backend/main.mo": "Motoko canister managing orders with create, fetch, list, and status‑update functions stored in a Map.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend React components and configuration files.",
  "frontend/index.css": "Tailwind‑based global stylesheet defining custom OKLCH color variables for light/dark themes and base styles.",
  "frontend/index.html": "Basic HTML entry point loading the React app and root mount container.",
  "frontend/src/App.tsx": "Sets up all application routes using TanStack Router and wraps pages in the SiteLayout.",
  "frontend/src/components/checkout/BitcoinPaymentInstructions.tsx": "UI card showing BTC payment info with copy‑to‑clipboard actions for order ID, amount, and address.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout with header navigation, footer, and container structure for all routed pages.",
  "frontend/src/components/storefront/DenominationRangeCallout.tsx": "Callout card highlighting the available USDT gift card range ($500–$50,000).",
  "frontend/src/components/storefront/DenominationSelector.tsx": "Dropdown selector for choosing predefined USDT gift card denominations.",
  "frontend/src/components/storefront/QuantitySelector.tsx": "Renders a quantity selector with increment, decrement, and validated manual input, enforcing min/max bounds.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, and identity persistence using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching, creating, and updating orders through the backend actor.",
  "frontend/src/index.css": "Sets global Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, providing Internet Identity and React Query contexts.",
  "frontend/src/pages/admin/AdminOrderDetailPage.tsx": "Admin page for viewing full order details and updating the order status.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin table view listing all orders with status badges and navigation to order detail pages.",
  "frontend/src/pages/CatalogPage.tsx": "Displays gift card catalog allowing denomination and quantity selection and saves cart session before checkout.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow, order creation, and payment instructions using saved cart data and mutation hooks.",
  "frontend/src/pages/HomePage.tsx": "Renders the marketing homepage with hero section, feature highlights, and navigation to the catalog.",
  "frontend/src/pages/OrderStatusPage.tsx": "Displays order status details, payment info, and conditional Bitcoin payment instructions based on order state.",
  "frontend/src/state/cartSession.ts": "Manages storing, retrieving, and clearing cart session data in sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, plugins, and container settings.",
  "project_state.json": "Defines the project’s current state for a crypto storefront site, detailing features, image requirements, and pending feature requests. Tracks versions, requirements, and configuration for building the Binance gift card sales platform."
}