{
  "backend/main.mo": "Motoko backend managing site ownership and order CRUD with admin-only access checks and stable storage for orders and owner principal.",
  "feature_evidence.json": "Feature evidence report listing affected frontend files, components, and test IDs for updating admin-route gating UX.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project structure.",
  "frontend/index.css": "Global Tailwind and OKLCH theme variables defining light/dark color tokens and base styling.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "React router setup defining public and admin routes, wrapping admin pages with AdminRouteGuard.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard handling login prompts, owner-claiming flow, and admin authorization checks before rendering children.",
  "frontend/src/components/checkout/BitcoinPaymentInstructions.tsx": "Checkout UI component showing BTC payment details with copy-to-clipboard helpers and order metadata.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main site layout with header, navigation, footer, and admin link logic based on identity and admin status.",
  "frontend/src/components/storefront/DenominationCardGrid.tsx": "Displays denomination selection cards using BTC/USDT rate data and highlights the selected option.",
  "frontend/src/components/storefront/DenominationRangeCallout.tsx": "Shows a callout card displaying the min and max supported USDT denominations.",
  "frontend/src/components/storefront/DenominationSelector.tsx": "Dropdown selector for choosing a specific USDT denomination from supported values.",
  "frontend/src/components/storefront/QuantitySelector.tsx": "Provides buttons and input to adjust quantity within min/max limits.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useBtcUsdtRate.ts": "Fetches and caches the BTC/USDT rate with fallback logic and exposes rate state for UI usage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, handling login, logout, identity persistence, and auth-client setup.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating order and admin-related data via the backend actor, including creation and status updates.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom CSS variables for light and dark themes, including Binance-themed color tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/admin/AdminOrderDetailPage.tsx": "Displays detailed admin view of a single order with status update controls and error handling.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Shows a table of all orders for admins with status badges and navigation to individual order pages.",
  "frontend/src/pages/CatalogPage.tsx": "Renders product catalog UI allowing users to choose denomination and quantity before saving to cart and moving to checkout.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles order creation with user input, BTC payment calculation, error handling, and success snapshot display.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with hero banner, feature highlights, and navigation to catalog and pricing.",
  "frontend/src/pages/OrderStatusPage.tsx": "Fetches and displays the status of a specific order with BTC/USDT info, badges, and error or loading states.",
  "frontend/src/state/cartSession.ts": "Manages saving, loading, and clearing cart session data in sessionStorage.",
  "frontend/src/utils/denominations.ts": "Exports a list of supported gift card denominations.",
  "frontend/src/utils/errors.ts": "Provides utilities to format and map errors into user-friendly messages.",
  "frontend/src/utils/pricing.ts": "Handles pricing calculations including discounts and BTC/USDT conversions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending themes, colors, fonts, and plugin setup.",
  "project_state.json": "Tracks project state, requirements, architectural notes, and known issues for a Binance Gift Card sales website using BTC payments. Highlights checkout bugs, BTC conversion issues, and admin access problems."
}