{
  "backend/main.mo": "Motoko backend actor managing site ownership, access control, user profiles, orders, and contact messages with authorization checks.",
  "backend/migration.mo": "Defines old and new actor state types and provides a no-op migration that returns the existing state unchanged.",
  "feature_evidence.json": "Metadata file mapping features to affected frontend files, components, and test IDs for build and verification tracking.",
  "frontend-file-summaries.txt": "Contains prewritten short summaries of various frontend files for reference or build planning.",
  "frontend/index.css": "Global Tailwind CSS variables and theme definitions, including light/dark mode OKLCH color tokens.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Configures the TanStack Router with routes, layout, and global error fallback handling for the React app.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard enforcing admin/owner access with Internet Identity login flow, ownership checks, and conditional rendering.",
  "frontend/src/components/checkout/BitcoinPaymentInstructions.tsx": "Displays Bitcoin payment details for an order with copy-to-clipboard helpers for address, amount, and order ID.",
  "frontend/src/components/error/GlobalErrorBoundary.tsx": "A React error boundary that catches rendering errors and displays a fallback UI with reset support.",
  "frontend/src/components/layout/SiteLayout.tsx": "Provides the main site layout with header navigation, admin visibility logic, recent orders menu, and footer.",
  "frontend/src/components/orders/RecentOrdersMenu.tsx": "Shows a dropdown of recent user orders with statuses, using order history and detail queries.",
  "frontend/src/components/storefront/DenominationCardGrid.tsx": "Renders selectable gift card denomination cards with BTC pricing using live rate data.",
  "frontend/src/components/storefront/DenominationRangeCallout.tsx": "Displays a callout highlighting the minimum and maximum supported USDT denominations.",
  "frontend/src/components/storefront/DenominationSelector.tsx": "A dropdown selector for choosing a USDT denomination from supported values.",
  "frontend/src/components/storefront/QuantitySelector.tsx": "Provides increment, decrement, and manual input controls for selecting a purchase quantity.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor, reinitializing it when the Internet Identity changes and invalidating related queries.",
  "frontend/src/hooks/useBtcUsdtRate.ts": "Fetches the BTC/USDT rate with caching, fallback handling, and periodic refresh using react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout helpers, and persistent identity handling via AuthClient.",
  "frontend/src/hooks/useOrderHistory.ts": "Loads and tracks persisted order history from storage with automatic updates on storage events.",
  "frontend/src/hooks/useOrderHistoryDetails.ts": "Fetches detailed order data for multiple order IDs using the backend actor and react-query.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for CRUD operations on orders and contact messages using the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind and defines theme variables, including light/dark modes and Binance-inspired colors.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with react-query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page describing the service, features, and platform benefits using styled UI components.",
  "frontend/src/pages/admin/AdminContactMessagesPage.tsx": "Admin page that lists all customer contact messages in a table with loading and error states.",
  "frontend/src/pages/admin/AdminOrderDetailPage.tsx": "Admin page for viewing detailed order info and updating order status with validation and error handling.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin overview page listing all orders with status badges and navigation to individual order details or messages.",
  "frontend/src/pages/CatalogPage.tsx": "Displays gift card catalog allowing users to select denomination and quantity, shows product details, and saves cart before navigating to checkout.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles order form submission, validates cart and user data, creates discounted BTC orders, and stores order snapshots while managing errors.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form for users to submit inquiries and handles success or error states using a backend mutation.",
  "frontend/src/pages/FaqPage.tsx": "Static FAQ page presenting common questions about Binance gift cards using an accordion layout.",
  "frontend/src/pages/GlobalErrorFallbackPage.tsx": "Global error fallback UI that displays error details, provides reload and home navigation options, and shows extra debug info in development.",
  "frontend/src/pages/HomePage.tsx": "Homepage with hero section, denomination callout, and feature highlights, directing users to browse the catalog or view pricing.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Displays a user's order history, loading states, and status badges by fetching summary and detailed order data.",
  "frontend/src/pages/OrderStatusPage.tsx": "Shows detailed status and payment info for a specific order, including BTC-to-USDT estimation and status icons.",
  "frontend/src/pages/TrackOrderPage.tsx": "Provides a form for users to enter an order ID and navigate to its status page, with basic validation and error display.",
  "frontend/src/state/cartSession.ts": "Provides helpers to save, load, and clear a cart session in sessionStorage.",
  "frontend/src/state/orderHistory.ts": "Manages a localStorage-backed order history with add, update, remove, and clear operations plus cross-tab sync.",
  "frontend/src/utils/denominations.ts": "Exports a fixed list of supported gift card denominations.",
  "frontend/src/utils/errors.ts": "Formats and normalizes errors into user-friendly messages and provides helpers to classify backend, connectivity, and authorization errors.",
  "frontend/src/utils/orderStatus.ts": "Converts backend order statuses into simplified labels and badge variants for display.",
  "frontend/src/utils/pricing.ts": "Implements discounting and USDT/BTC conversion utilities with formatting helpers.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters using URL and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, fonts, containers, and plugin setup.",
  "project_state.json": "Metadata describing project state, issues, and required fixes for production load errors."
}