{
  "backend/main.mo": "Motoko canister implementing site ownership, admin authorization, user profiles, order creation and management, and contact message storage with access control checks.",
  "feature_evidence.json": "Feature evidence report listing required fixes and associated frontend files, components, and test IDs for three high-confidence features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend components, pages, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind and OKLCH-based theme variables for light and dark modes defining layout, colors, and component styling.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router configuration with layout, public routes, admin routes, and global error handling using GlobalErrorBoundary and GlobalErrorFallbackPage.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard that handles authentication, ownership verification, login prompts, and conditional access to admin pages with detailed UI states.",
  "frontend/src/components/checkout/BitcoinPaymentInstructions.tsx": "Displays Bitcoin payment details for an order with copy-to-clipboard actions for order ID, address, and amount.",
  "frontend/src/components/error/GlobalErrorBoundary.tsx": "A React error boundary that captures errors, logs them safely, and renders a provided fallback UI.",
  "frontend/src/components/error/SafeSection.tsx": "Wraps UI sections in an error boundary to prevent non‑critical failures from breaking the app.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main site layout with header, navigation, footer, and conditional admin link handling.",
  "frontend/src/components/orders/RecentOrdersMenu.tsx": "Shows a dropdown of recent orders with status, loading states, and links to order details.",
  "frontend/src/components/storefront/DenominationCardGrid.tsx": "Renders selectable gift card denomination cards using BTC rate data and discount calculations.",
  "frontend/src/components/storefront/DenominationRangeCallout.tsx": "Displays the minimum and maximum supported denominations in a styled callout.",
  "frontend/src/components/storefront/DenominationSelector.tsx": "A dropdown selector for choosing a USDT denomination from supported values.",
  "frontend/src/components/storefront/QuantitySelector.tsx": "A quantity selector component with increment, decrement, and direct numeric input constrained by min/max values.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useBtcUsdtRate.ts": "Fetches and auto-refreshes the BTC/USDT rate with caching, fallback logic, and status info.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identities, and auth-client setup.",
  "frontend/src/hooks/useOrderHistory.ts": "Loads and syncs persisted order history with safe error handling and storage event updates.",
  "frontend/src/hooks/useOrderHistoryDetails.ts": "Fetches detailed order data for multiple order IDs using the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on orders and contact messages using the actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables and theming for light and dark modes.",
  "frontend/src/main.tsx": "App entry point initializing React Query, Internet Identity provider, and rendering the application.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with cards explaining the company, its offerings, and how the service works. Provides descriptive text and icon-enhanced sections about features and platform security.",
  "frontend/src/pages/admin/AdminContactMessagesPage.tsx": "Admin page listing customer contact messages with loading and error states, presented in a table format.",
  "frontend/src/pages/admin/AdminOrderDetailPage.tsx": "Admin page that loads a single order, displays its details, and allows updating its status with error and loading states.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin dashboard page that lists all orders with status badges, error handling, and navigation to order details and messages.",
  "frontend/src/pages/CatalogPage.tsx": "Displays the gift card catalog with denomination selection, quantity input, product details, and checkout initiation. Saves the cart session and navigates users to the checkout page.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements the checkout form, validates user input, creates orders, calculates BTC amounts with discounts, and shows payment instructions. Manages cart session cleanup and error handling during order creation.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form to submit inquiries, handling form state, validation, success alerts, and API mutation errors. Resets inputs after successful message submission.",
  "frontend/src/pages/FaqPage.tsx": "Renders a FAQ page using an accordion layout covering common questions about gift cards, payments, delivery, discounts, and order tracking.",
  "frontend/src/pages/GlobalErrorFallbackPage.tsx": "Displays a global error fallback UI with reload and home navigation options, showing error details in development mode.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, product highlights, and navigation to the catalog and pricing.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Shows a user's past orders with status, loading states, and links to catalog or detailed order info.",
  "frontend/src/pages/OrderStatusPage.tsx": "Displays detailed status and payment info for a specific order, including BTC-to-USDT estimates and status icons.",
  "frontend/src/pages/TrackOrderPage.tsx": "Provides an input form for users to enter an order ID and navigate to its status page.",
  "frontend/src/state/cartSession.ts": "Utilities for saving, loading, and clearing cart data in sessionStorage with basic error handling.",
  "frontend/src/state/orderHistory.ts": "LocalStorage-backed order history manager with in-memory fallback, supporting add, update, load, and remove operations.",
  "frontend/src/utils/denominations.ts": "Exports the list of supported gift card denominations.",
  "frontend/src/utils/errors.ts": "Utility functions for normalizing, formatting, and categorizing errors into user-friendly messages.",
  "frontend/src/utils/orderStatus.ts": "Maps backend order statuses to simplified labels and badge variants for UI display.",
  "frontend/src/utils/pricing.ts": "Pricing utilities for discounts and USDT/BTC conversions, including formatting helpers.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing) and persist them in sessionStorage with optional clearing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, layout settings, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current state, including issues and feature requirements related to diagnosing and fixing a production load crash."
}