{
  "kind": "build_request",
  "title": "Apply 50% pricing rule for BTC payment instructions and restrict Admin Panel to owner-only",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Apply a global 50% pricing rule so that the amount shown in Bitcoin payment instructions reflects half of the selected gift card USDT total (e.g., a $500 card charges $250 worth of BTC), consistently across Checkout success view and the Order Status page for pending-payment orders.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Prices half rakhni hain Like agr koi $500 ka Card ka order krta ha to payment instructions pr half price show ho like 500$ card ki price $250 equivalent to bitcoin. isi trh sb Cards ki Price half"
        ]
      },
      "acceptanceCriteria": [
        "On Checkout, after clicking “Create Order & Get Payment Instructions”, the displayed BTC amount is calculated from (cartSession.total * 0.5) instead of (cartSession.total).",
        "The BitcoinPaymentInstructions component’s “≈ $X USDT” line shows the discounted USDT amount (half of the selected total), not the original total.",
        "On the Order Status page, when an order is in Pending Payment, the BitcoinPaymentInstructions section also shows the discounted USDT approximation (not 0).",
        "Backend order data includes a field for the discounted USDT amount (or equivalent) so the Order Status page can display it without relying on cart/session state.",
        "Existing (non-admin) order creation and order lookup flows continue to work without requiring login."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Restrict Admin Panel access so only the site owner can access admin routes and admin backend operations (listing all orders and updating order status). Use Internet Identity for owner authentication/authorization and show an English “Access denied” experience to non-owners.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Or Dsri Chez ye k Admin Panel ko sirf mai he Access kro koi or nii sirf main q k mai owner hu na"
        ]
      },
      "acceptanceCriteria": [
        "Visiting /admin/orders or /admin/orders/:orderId as an anonymous user prompts login (Internet Identity) or shows a clear English message indicating login is required.",
        "After login, only the configured owner identity can view AdminOrdersPage and AdminOrderDetailPage; non-owner authenticated users see an English “Access denied” message and cannot view admin data.",
        "Backend enforces owner-only authorization for getAllOrders and updateOrderStatus (and any other admin-only methods); non-owner calls fail even if the frontend is bypassed.",
        "Owner can still successfully view all orders and update statuses from the admin UI.",
        "User-facing error messages for blocked admin access are in English and do not expose sensitive internals."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not add third-party authentication providers; only Internet Identity is allowed."
  ],
  "nonGoals": [
    "Do not implement live BTC pricing/oracle integration; keep the existing approach for deriving BTC amounts but apply the 50% rule to the USDT basis used for calculation and display.",
    "Do not add multi-admin roles or a full admin user management system; owner-only access is sufficient.",
    "Do not change the existing denomination range ($500–$50,000) or catalog selection UX beyond what is necessary to reflect the 50% pricing in payment instructions."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for any user-facing text."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}