{
  "kind": "build_request",
  "title": "Fix persistent production load crash showing global error fallback",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Identify and fix the root cause of the production runtime error that causes the app to render only the global “Something went wrong” fallback on initial page load (including on the root route `/`). The fix must ensure the production build loads successfully without triggering the TanStack Router errorComponent.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Still same error arha yr pta ni q.. phly to ni arha tha"
        ]
      },
      "acceptanceCriteria": [
        "In production, loading `/` renders the Home page content within `SiteLayout` and does not show the GlobalErrorFallbackPage.",
        "No uncaught exceptions occur during initial page load in the browser console (excluding expected network warnings).",
        "If an error still occurs, the console output includes enough context (error + stack, where available) to pinpoint the failing module/component without causing additional crashes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Harden the global error fallback implementation so it cannot itself cause crashes in production builds. Ensure all environment checks are browser-safe (use `import.meta.env` only), and guard all error-detail rendering so that unknown thrown values cannot break the fallback. All user-facing text in the fallback must remain in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Still same error arha yr pta ni q.. phly to ni arha tha"
        ]
      },
      "acceptanceCriteria": [
        "GlobalErrorFallbackPage renders without throwing even when `error` is `undefined`, a string, or a non-Error object.",
        "No usage of `process.env.*` exists in runtime-executed frontend code paths for error fallback/handling.",
        "All visible fallback UI strings are in English."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the app shell (`SiteLayout`) and initial routing can render even when backend connectivity, actor creation, or initial React Query calls fail. Non-critical layout queries (e.g., ownership/admin checks and recent orders dropdown data) must not crash the entire app and must degrade gracefully (hide admin link, disable orders menu, and avoid throwing).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Still same error arha yr pta ni q.. phly to ni arha tha"
        ]
      },
      "acceptanceCriteria": [
        "If the backend actor is not ready or backend calls fail, `SiteLayout` still renders header, footer, and the current route outlet.",
        "Admin link is shown only when ownership is positively confirmed; otherwise it stays hidden without errors.",
        "RecentOrdersMenu does not throw on load; when the actor is not ready it renders a disabled Orders button (or equivalent non-crashing UI)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or any files in `frontend/src/components/ui` (compose them instead).",
    "Respect single-actor backend architecture; keep Motoko logic in `backend/main.mo` and only add `backend/migration.mo` changes if state migration is required.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new product features unrelated to fixing the production load error.",
    "Introducing new backend services, external databases, or third-party auth providers (Internet Identity only).",
    "UI redesign beyond what is necessary to prevent crashes and improve graceful degradation during backend/actor failures."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}