{
  "kind": "build_request",
  "title": "Binance-style promo ticker, real-time BTC pricing, and UI polish",
  "projectName": "Binance Gift Cards",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a Binance-style top running ticker banner that is visible across the site (all routes) and continuously scrolls a promotional message about a limited-time 50% discount.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "1 upr Ticker run krta rhy jis mai Flash 50% discount on all orders k bary mai btaya ho k ye offer kisi special waja se mil rhi sirf limited time k liye etc etc…",
          "Ticker binance style or han ticker text thora engaging or bhi kuch attractive persuading line add kr"
        ]
      },
      "acceptanceCriteria": [
        "A ticker/banner appears at the very top of the app on every page and scrolls horizontally (marquee-style).",
        "Ticker visual style matches a Binance-like look (binance-yellow accent, dark background, high contrast, compact height).",
        "Ticker continues animating smoothly and does not block page interaction or cause layout shift.",
        "Ticker is responsive (works on mobile and desktop) and does not overlap the sticky header/navigation."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the ticker message copy to be more engaging and persuasive (English only) while clearly communicating: “Flash 50% discount on all orders”, a limited-time nature, and a special/bonus reason for the offer.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Ticker binance style or han ticker text thora engaging or bhi kuch attractive persuading line add kr"
        ]
      },
      "acceptanceCriteria": [
        "Ticker text is in English and includes: (1) Flash sale/50% off wording, (2) limited-time urgency, and (3) a special-offer reason (e.g., bonus, anniversary, limited allocation) without sounding like placeholder text.",
        "The full message is readable during scrolling (adequate spacing, no clipping)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure BTC/USDT pricing is real-time and auto-refreshes, and that all BTC-derived amounts displayed in the UI update according to the latest fetched rate (including any top/summary rate display and the catalog pricing calculations).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Bitcoin ki Live price mention ki hui wo to kafi time sy Stable ha ... wo Real time update hoti jae usi hisab sy neechy price mai bhi BTC update hota jae tmny to usko static rkha hua"
        ]
      },
      "acceptanceCriteria": [
        "The BTC/USDT rate used for UI conversions auto-refreshes without requiring a page reload.",
        "When the rate changes, BTC amounts shown for the same USDT denomination update accordingly in the catalog UI.",
        "Loading and fallback states for the rate do not break the page; the UI continues to render gracefully."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Make gift card denomination cards smaller and more Binance-like in layout and density, avoiding a black/brown theme and keeping the existing Binance-style color palette.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "gift cards thory small kr ... black brown theme na dy lakin binance ki trh lgy k bianane gift cards hain"
        ]
      },
      "acceptanceCriteria": [
        "Denomination cards appear more compact (reduced padding/typography scale) while remaining readable and tappable on mobile.",
        "The overall styling maintains a Binance-like dark + yellow aesthetic and does not introduce black/brown styling.",
        "Selected/hover states remain clear and consistent with the Binance accent color."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Remove the “Built with ❤️ using caffeine.ai” branding/link from the footer UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Or secondly built with caffeine ai ye bhi remove krdy.."
        ]
      },
      "acceptanceCriteria": [
        "The footer no longer displays any “Built with … caffeine.ai” text or link.",
        "No other footer content (copyright, links) is removed unintentionally."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (compose them instead).",
    "Do not modify files listed as immutable in SYSTEM_CONTEXT (e.g., useActor/useInternetIdentity/main.tsx).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "No backend/Motoko changes are required for the ticker, footer text removal, or UI styling changes.",
    "Do not add third-party auth providers or external databases.",
    "Do not add real-time transport features (e.g., WebSockets)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}