{
  "kind": "build_request",
  "title": "Fix live BTC price feed and remove 'rate unavailable' by adding a working API fallback + ticker display",
  "projectName": "Binance Gift Cards",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the BTC/USDT live rate hook to use a real, reliable live price API with automatic refresh, and add a second API fallback so the app does not get stuck on a 'rate unavailable' state when one provider fails (e.g., keep CoinGecko but add a second provider such as Binance BTCUSDT ticker).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "O bhai Bitcoin price to update krdy Live Price tum kr he ni rhy… rate unavailable arhaa tum koi API add kr he ni rhy jo live bitcoin price current price update de us mai 😮‍💨 mere credits zaya krwa rha bs tuu"
        ]
      },
      "acceptanceCriteria": [
        "When the primary rate provider request fails (non-2xx, timeout, invalid JSON/shape), the hook automatically attempts the fallback provider and returns a live rate if the fallback succeeds.",
        "The hook continues to auto-refresh at least every 60 seconds (existing behavior preserved) and refreshes on reconnect/focus.",
        "The hook returns a usable rate along with metadata indicating which provider was used (e.g., 'CoinGecko', 'Binance', 'Cached', 'Fallback'), without breaking existing consumers (DenominationCardGrid, OrderStatusPage).",
        "If both live providers fail, the hook uses the last cached successful rate (even if older than the current 1-hour limit) when available, and clearly marks it as cached/stale via the returned source/flags.",
        "Only if no cached rate exists does the hook use the hardcoded fallback rate, and it must be clearly flagged as fallback in the returned state."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a live BTC price readout to the top promo ticker so users can see the current BTC price updating automatically, and ensure the ticker shows clear English status when the live price cannot be fetched (e.g., 'Live BTC price unavailable — showing cached rate').",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Bitcoin price to update krdy Live Price ... rate unavailable ... live bitcoin price current price update"
        ]
      },
      "acceptanceCriteria": [
        "PromoTicker displays the current BTC/USDT value in a concise format (e.g., 'BTC: $xx,xxx') and updates as the rate hook refetches.",
        "If the hook is currently loading, the ticker shows an English loading state (e.g., 'Loading BTC price…') without rendering 'undefined' or a blank value.",
        "If the app is using cached or fallback pricing, the ticker displays an English indicator reflecting that state (cached vs fallback) instead of silently showing a price.",
        "No user-facing ticker text contains non-English copy (keep user-facing text in English)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure all storefront and order pages that display BTC conversions use the same effective live rate data and show a consistent, user-friendly English indicator when the displayed conversion is based on cached or fallback pricing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "rate unavailable arhaa"
        ]
      },
      "acceptanceCriteria": [
        "DenominationCardGrid continues to render the rate label and badge state correctly, and the badge text remains accurate based on the updated hook sources (including any new provider).",
        "OrderStatusPage continues to display 'Based on current rate (SOURCE)' and SOURCE correctly reflects the actual provider/cached/fallback state returned by the hook.",
        "No part of the UI shows a misleading 'live' label when the app is using fallback pricing."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn components are read-only and must be composed).",
    "Do not modify frontend immutable hook files listed in SYSTEM_CONTEXT (useActor/useInternetIdentity/main entry).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Adding third-party authentication beyond Internet Identity.",
    "Adding external databases or any non-Internet-Computer backend services.",
    "Implementing real-time sockets/WebSockets for price streaming (periodic polling is sufficient)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "User-facing text should be English"
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}