{
  "kind": "build_request",
  "title": "Fix Admin access denied for site owner (Internet Identity owner principal mismatch / uninitialized owner)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-21",
      "text": "Persist a single site-owner Principal in the Motoko backend and use it as the source of truth for admin authorization, so the owner can access admin-only APIs reliably after upgrades/redeploys.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "Yr mai he owner hu mai ny he tjhsy bnwai hai to mjhy Access Denied q arha isko solve kr"
        ]
      },
      "acceptanceCriteria": [
        "Backend stores an explicit owner Principal in stable state and uses it for admin checks (not an ephemeral in-memory-only value).",
        "After a canister upgrade, the stored owner Principal remains unchanged and admin checks continue to work.",
        "Admin-only methods (e.g., getAllOrders, updateOrderStatus) authorize the stored owner Principal and reject non-owner principals with an English error message."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Add backend APIs to (1) read the currently configured owner principal and (2) allow a one-time ownership claim when no owner is configured yet, so the real owner can resolve an 'Access Denied' situation without redeploying.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "Yr mai he owner hu mai ny he tjhsy bnwai hai to mjhy Access Denied q arha isko solve kr"
        ]
      },
      "acceptanceCriteria": [
        "A query endpoint exists to return the configured owner Principal (or an empty/none value if not configured).",
        "A shared endpoint exists to claim/set the owner Principal only when no owner is currently configured; it sets owner = caller and succeeds exactly once.",
        "After ownership is claimed, subsequent attempts to claim/reset ownership by non-owner principals fail with an English error message.",
        "(Optional but allowed) A shared endpoint exists to transfer ownership that is callable only by the current owner."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Update the frontend admin-route gating UX to help the real owner self-resolve 'Access Denied' when the backend has no owner configured yet, using only English user-facing text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "Yr mai he owner hu mai ny he tjhsy bnwai hai to mjhy Access Denied q arha isko solve kr"
        ]
      },
      "acceptanceCriteria": [
        "When a logged-in user visits /admin/orders and is not recognized as admin, the UI checks whether an owner is configured in the backend.",
        "If no owner is configured, the Access Denied screen offers an explicit English action to claim ownership (e.g., a 'Claim Admin Access' button) and shows clear success/failure feedback.",
        "If an owner is configured and the logged-in user is not the owner, the UI shows the existing English 'Access Denied' experience without offering a claim/reset option.",
        "After successfully claiming ownership, the user can access /admin/orders without seeing 'Access Denied', and the Admin link becomes visible where appropriate."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko main actor (all logic in backend/main.mo).",
    "Use Internet Identity for authentication/authorization; no third-party auth providers.",
    "Do not edit any files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT.",
    "All user-facing text introduced/modified for this fix must be in English."
  ],
  "nonGoals": [
    "Adding multi-admin support or role management beyond a single site owner (unless already present).",
    "Changing the existing admin routes (keep /admin/orders and /admin/orders/$orderId).",
    "Adding external databases or third-party services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}