{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Binance-style promo ticker, real-time BTC pricing, and UI polish",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a Binance-style top promo ticker visible across all routes with smooth marquee scrolling.",
      "acceptanceCriteria": [
        "A ticker/banner appears at the very top of the app on every page and scrolls horizontally (marquee-style).",
        "Ticker visual style matches a Binance-like look (binance-yellow accent, dark background, high contrast, compact height).",
        "Ticker continues animating smoothly and does not block page interaction or cause layout shift.",
        "Ticker is responsive (works on mobile and desktop) and does not overlap the sticky header/navigation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/PromoTicker.tsx",
          "operation": "create",
          "description": "Create a reusable PromoTicker layout component that renders a compact, high-contrast Binance-style marquee banner and does not capture pointer events (so it won't block page interaction)."
        },
        {
          "path": "frontend/src/components/layout/SiteLayout.tsx",
          "operation": "modify",
          "description": "Wire PromoTicker into the global layout so it appears on every route, reserving vertical space to avoid layout shift and offsetting the sticky header so it does not overlap the ticker."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add global CSS keyframes and utility classes for the ticker marquee animation (smooth continuous scroll) and compact styling aligned to the existing Binance theme variables."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Replace ticker copy with engaging English promo messaging communicating flash 50% off, urgency, and a special reason.",
      "acceptanceCriteria": [
        "Ticker text is in English and includes: (1) Flash sale/50% off wording, (2) limited-time urgency, and (3) a special-offer reason (e.g., bonus, anniversary, limited allocation) without sounding like placeholder text.",
        "The full message is readable during scrolling (adequate spacing, no clipping)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/PromoTicker.tsx",
          "operation": "modify",
          "description": "Update the ticker message string(s) to an engaging English-only line that clearly includes: flash 50% discount on all orders, limited-time urgency, and a specific special-offer reason; ensure spacing prevents clipping while scrolling."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure BTC/USDT rate auto-refreshes and all BTC-derived UI amounts update from the latest fetched rate with graceful loading/fallback.",
      "acceptanceCriteria": [
        "The BTC/USDT rate used for UI conversions auto-refreshes without requiring a page reload.",
        "When the rate changes, BTC amounts shown for the same USDT denomination update accordingly in the catalog UI.",
        "Loading and fallback states for the rate do not break the page; the UI continues to render gracefully."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBtcUsdtRate.ts",
          "operation": "modify",
          "description": "Harden the auto-refresh behavior for the BTC/USDT query (keep periodic refresh; ensure the query continues refetching under typical user conditions such as window focus/reconnect) while preserving existing cached/fallback logic and safe UI state flags."
        },
        {
          "path": "frontend/src/components/storefront/DenominationCardGrid.tsx",
          "operation": "modify",
          "description": "Ensure all BTC-derived amounts in the denomination grid are computed from the latest rate returned by useBtcUsdtRate (single source of truth) and that loading/fallback labels render without breaking layout."
        },
        {
          "path": "frontend/src/pages/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Ensure any BTC conversion/summary text shown during checkout reads the latest rate from useBtcUsdtRate so displayed BTC estimates update automatically while keeping the page functional during rate loading/fallback."
        },
        {
          "path": "frontend/src/pages/OrderStatusPage.tsx",
          "operation": "modify",
          "description": "Ensure BTC-derived estimate displays on the order status page continue to use the latest rate from useBtcUsdtRate and render safely when the rate is loading or falling back."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Make denomination cards more compact and Binance-like while keeping the existing dark + yellow palette (no black/brown theme).",
      "acceptanceCriteria": [
        "Denomination cards appear more compact (reduced padding/typography scale) while remaining readable and tappable on mobile.",
        "The overall styling maintains a Binance-like dark + yellow aesthetic and does not introduce black/brown styling.",
        "Selected/hover states remain clear and consistent with the Binance accent color."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/storefront/DenominationCardGrid.tsx",
          "operation": "modify",
          "description": "Adjust denomination card density (smaller typography, reduced padding, tighter grid gaps, compact badges) while preserving Binance dark surfaces and binance-yellow accents; keep selected/hover borders and glows clear and consistent."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Remove the caffeine.ai branding/link from the footer without removing other footer content.",
      "acceptanceCriteria": [
        "The footer no longer displays any “Built with … caffeine.ai” text or link.",
        "No other footer content (copyright, links) is removed unintentionally."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/SiteLayout.tsx",
          "operation": "modify",
          "description": "Remove the “Built with ❤️ using caffeine.ai” line/link from the footer while keeping the rest of the footer structure and content unchanged."
        }
      ]
    }
  ]
}