{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Reliable BTC/USDT polling with API fallback + live ticker readout and consistent cached/fallback indicators",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Harden BTC/USDT rate hook with a reliable live provider, automatic refresh, and a second provider fallback plus improved cache/fallback behavior and metadata.",
      "acceptanceCriteria": [
        "When the primary rate provider request fails (non-2xx, timeout, invalid JSON/shape), the hook automatically attempts the fallback provider and returns a live rate if the fallback succeeds.",
        "The hook continues to auto-refresh at least every 60 seconds (existing behavior preserved) and refreshes on reconnect/focus.",
        "The hook returns a usable rate along with metadata indicating which provider was used (e.g., 'CoinGecko', 'Binance', 'Cached', 'Fallback'), without breaking existing consumers (DenominationCardGrid, OrderStatusPage).",
        "If both live providers fail, the hook uses the last cached successful rate (even if older than the current 1-hour limit) when available, and clearly marks it as cached/stale via the returned source/flags.",
        "Only if no cached rate exists does the hook use the hardcoded fallback rate, and it must be clearly flagged as fallback in the returned state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBtcUsdtRate.ts",
          "operation": "modify",
          "description": "Update the hook to (1) fetch BTC/USDT from a primary provider (keep CoinGecko) and (2) automatically fall back to a second provider (e.g., Binance BTCUSDT ticker) on any primary failure, including non-2xx, timeout, or invalid JSON/shape. Preserve existing polling/refresh behavior (>=60s, refetch on focus/reconnect). Expand returned metadata to include the actual provider used (e.g., 'CoinGecko' | 'Binance' | 'Cached' | 'Fallback') and add explicit flags for cached vs cached-stale vs hardcoded fallback while keeping existing return fields compatible for current consumers."
        },
        {
          "path": "frontend/src/utils/btcRate.ts",
          "operation": "create",
          "description": "Add shared utilities for BTC rate formatting and user-facing English status messaging based on the hook state (live vs cached vs cached-stale vs hardcoded fallback) so multiple UI surfaces can render consistent indicator text without duplicating logic."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Show a live BTC price readout in the top promo ticker with clear English loading/unavailable/cached/fallback status.",
      "acceptanceCriteria": [
        "PromoTicker displays the current BTC/USDT value in a concise format (e.g., 'BTC: $xx,xxx') and updates as the rate hook refetches.",
        "If the hook is currently loading, the ticker shows an English loading state (e.g., 'Loading BTC price…') without rendering 'undefined' or a blank value.",
        "If the app is using cached or fallback pricing, the ticker displays an English indicator reflecting that state (cached vs fallback) instead of silently showing a price.",
        "No user-facing ticker text contains non-English copy (keep user-facing text in English)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/PromoTicker.tsx",
          "operation": "modify",
          "description": "Wire PromoTicker to consume useBtcUsdtRate and display a concise live BTC readout (e.g., 'BTC: $xx,xxx') that updates automatically. Add explicit English UI states for loading and for unavailable live price (e.g., showing cached rate vs hardcoded fallback), leveraging the shared btcRate utilities for consistent messaging."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure all conversion displays use the same effective rate and consistently label cached/fallback pricing in English across storefront and order pages.",
      "acceptanceCriteria": [
        "DenominationCardGrid continues to render the rate label and badge state correctly, and the badge text remains accurate based on the updated hook sources (including any new provider).",
        "OrderStatusPage continues to display 'Based on current rate (SOURCE)' and SOURCE correctly reflects the actual provider/cached/fallback state returned by the hook.",
        "No part of the UI shows a misleading 'live' label when the app is using fallback pricing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/storefront/DenominationCardGrid.tsx",
          "operation": "modify",
          "description": "Update the storefront rate indicator to reflect the expanded hook metadata: show provider names (including the new fallback provider), and display accurate English badges/labels when using cached, cached-stale, or hardcoded fallback pricing. Ensure no UI implies a live rate when cached/fallback is in effect, and continue using the hook’s effectiveRate for all BTC conversions."
        },
        {
          "path": "frontend/src/pages/OrderStatusPage.tsx",
          "operation": "modify",
          "description": "Adjust the 'Based on current rate (SOURCE)' line to use the updated hook metadata and consistent English wording for cached/cached-stale/fallback scenarios (while still showing SOURCE accurately). Ensure the page continues using the same effectiveRate value returned by the hook for conversion calculations."
        }
      ]
    }
  ]
}